import "./Members.css";
import profile from "../images/profile.png"; // default profile icon

const members = [
  { id: 1, name: "ಶ್ರೀ ಸದಾಶಿವ ಆಚಾರ್ಯ, ಬೈಲೂರು." },
  { id: 2, name: "ಶ್ರೀ ಕೆ. ಎಸ್. ದಿನೇಶ್ ಆಚಾರ್ಯ, ಕಂಡಲ್ಕೆ." },
  { id: 3, name: "ಶ್ರೀ ಅಜಯ್ ಬಿ. ಆಚಾರ್ಯ, ಜಾರ್ಕಳ." },
  { id: 4, name: "ಶ್ರೀ ಹರೀಶ್, ಕೌಡೂರು." },
  { id: 5, name: "ಶ್ರೀ ವಾದಿರಾಜ ಆಚಾರ್ಯ, ನೀರೆ ಕಲ್ಲೋಟ್ಟೆ." },
  { id: 6, name: "ಶ್ರೀ ಗಣೇಶ್ ಆಚಾರ್ಯ, ಬೈಲೂರು." },
  { id: 7, name: "ಶ್ರೀ ಸಂತೋಷ್ ಆಚಾರ್ಯ, ಜಾರ್ಕಳ." },
  { id: 8, name: "ಶ್ರೀ ಸತೀಶ್ ಆಚಾರ್ಯ, ಕುಕ್ಕುಡೆ" },
  { id: 9, name: "ಶ್ರೀ ಸುದರ್ಶನ್ ಆಚಾರ್ಯ, ಕಜಕೆಗುಡ್ಡೆ, ಎರ್ಲಪಾಡಿ." },
  { id: 10, name: "ಶ್ರೀ ನಾಗರಾಜ ಆಚಾರ್ಯ, ಜಾರ್ಕಳ." },
  { id: 11, name: "ಶ್ರೀ ರಾಘವೇಂದ್ರ ಆಚಾರ್ಯ, ನೀರೆ ಗುಂಡಿಬೈಲ್." },
  { id: 12, name: "ಶ್ರೀ ಜಿ. ರಾಜೇಶ್ ಆಚಾರ್ಯ, ಗೋವಿಂದೂರ್." },

   { id: 13, name: "ಶ್ರೀ ರಾಮಕೃಷ್ಣ ಆಚಾರ್ಯ, ಜಾರ್ಕಳ." },
  { id: 14, name: "ಶ್ರೀ ಜಿ. ದೀಪಕ್ ಆಚಾರ್ಯ, ಬೈಲೂರು." },
  { id: 15, name: "ಶ್ರೀ ದಿನೇಶ್ ಆಚಾರ್ಯ , ಕುಂಟಲ್ಪಾಡಿ." },
  { id: 16, name: "ಶ್ರೀ ಉದಯ ಆಚಾರ್ಯ, ಬೈಲೂರು." },
  { id: 17, name: "ಶ್ರೀ ಪ್ರಶಾಂತ್ ಆಚಾರ್ಯ, ನೀರೆ ಬಾದಾಮಿಕಟ್ಟೆ." },
   { id: 18, name: "ಶ್ರೀ ನಾಗೇಂದ್ರ ಆಚಾರ್ಯ, ಎರ್ಲಪಾಡಿ." },
  { id: 19, name: "ಶ್ರೀ ಗುರುರಾಜ ಆಚಾರ್ಯ, ಎರ್ಲಪಾಡಿ." },

];

function Members() {
  return (
    <div className="page members-bg members">
      {members.map((member) => (
        <div className="member-card" key={member.id}>
          <img src={profile} alt="profile" />
          <h4>{member.name}</h4>
          <p>🌸🌸🌸</p>
        </div>
      ))}
    </div>
  );
}

export default Members;
